hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/whd-bsp-integration/cybsp_wifi.c
/***********************************************************************************************//**
 * \file cybsp_wifi.c
 *
 * \brief
 * Provides utility functions that are used by board support packages.
 *
 ***************************************************************************************************
 * \copyright
 * Copyright 2018-2022 Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 **************************************************************************************************/

#include "cybsp.h"
#include "cybsp_wifi.h"
#include "cy_network_buffer.h"
#include "cyabs_rtos.h"
#include "whd_types.h"
#if defined(COMPONENT_MTB_HAL)
#include "mtb_hal_hw_types.h"
#include "mtb_hal_system.h"
#include "mtb_hal_sdio.h"
#include "mtb_hal_spi.h"
#endif
#if defined(CY_USING_HAL)
#include "cyhal.h"
#endif

#ifdef COMPONENT_CAT5
#include "whd_int.h"
#endif

#if defined(__cplusplus)
extern "C" {
#endif

/**
 * \addtogroup group_bsp_wifi
 * \{
 * Macros to abstract out whether the LEDs & Buttons are wired high or active low.
 */

/** Defines the amount of stack memory available for the wifi thread. */
#if !defined(CY_WIFI_THREAD_STACK_SIZE)
#define CY_WIFI_THREAD_STACK_SIZE           (5120)
#endif

/** Defines the priority of the thread that services wifi packets. Legal values are defined by the
 *  RTOS being used.
 */
#if !defined(CY_WIFI_THREAD_PRIORITY)
#ifndef COMPONENT_CAT5
#define CY_WIFI_THREAD_PRIORITY             (CY_RTOS_PRIORITY_HIGH)
#else
#define CY_WIFI_THREAD_PRIORITY             (CY_RTOS_PRIORITY_MAX)
#endif /* WHD_TO_TEST */
#endif

/** Defines the country this will operate in for wifi initialization parameters. See the
 *  wifi-host-driver's whd_country_code_t for legal options.
 */
#if !defined(CY_WIFI_COUNTRY)
#define CY_WIFI_COUNTRY                     (WHD_COUNTRY_AUSTRALIA)
#endif

/** Defines the priority of the interrupt that handles out-of-band notifications from the wifi
 *  chip. Legal values are defined by the MCU running this code.
 */
#if !defined(CY_WIFI_OOB_INTR_PRIORITY)
    #define CY_WIFI_OOB_INTR_PRIORITY       (2)
#endif

/** Defines whether to use the out-of-band pin to allow the WIFI chip to wake up the MCU. */
#if defined(CY_WIFI_HOST_WAKE_SW_FORCE)
    #define CY_USE_OOB_INTR                 (CY_WIFI_HOST_WAKE_SW_FORCE)
#else
    #define CY_USE_OOB_INTR                 (1u)
#endif // defined(CY_WIFI_HOST_WAKE_SW_FORCE)

/** Default GPIO drive mode for CYBSP_WIFI_WL_REG_ON. Override with Makefile define  */
#ifndef CYBSP_WIFI_WL_REG_ON_GPIO_DRIVE_MODE
#if defined(COMPONENT_MTB_HAL)
#define CYBSP_WIFI_WL_REG_ON_GPIO_DRIVE_MODE    (MTB_HAL_GPIO_DRIVE_PULLUP)
#else
#define CYBSP_WIFI_WL_REG_ON_GPIO_DRIVE_MODE    (CYHAL_GPIO_DRIVE_PULLUP)
#endif
#endif
/** Default GPIO drive mode for CYBSP_WIFI_WL_HOSTWAKE. Override with Makefile define  */
#ifndef CYBSP_WIFI_WL_HOSTWAKE_DRIVE_MODE
#if defined(COMPONENT_MTB_HAL)
#define CYBSP_WIFI_WL_HOSTWAKE_DRIVE_MODE        (MTB_HAL_GPIO_DRIVE_NONE)
#else
#define CYBSP_WIFI_WL_HOSTWAKE_DRIVE_MODE        (CYHAL_GPIO_DRIVE_NONE)
#endif
#endif

/** Default GPIO drive mode for CYBSP_WIFI_WL_HOSTWAKE. Override with Makefile define  */
#ifndef CYBSP_WIFI_WL_HOSTWAKE_INIT_STATE
#define CYBSP_WIFI_WL_HOSTWAKE_INIT_STATE       (WHD_FALSE)
#endif


/** \} group_bsp_wifi */

#define DEFAULT_OOB_PIN                     (0)
#define WLAN_POWER_UP_DELAY_MS              (250)
#define WLAN_CBUCK_DISCHARGE_MS             (10)

#if defined(COMPONENT_WIFI_INTERFACE_SDIO)

// Old versions of the BSP performed WIFI SDIO init as part of cybsp_init() this has been replaced
// with just minimal resource reservation when needed in the latest versions of BSPs.
#define CYBSP_WIFI_SDIO_NEEDS_INIT          (1)

#else

#if defined(CYBSP_WIFI_INTERFACE_TYPE) && (CYBSP_WIFI_INTERFACE_TYPE == CYBSP_SDIO_INTERFACE)
#if !defined(COMPONENT_WIFI_INTERFACE_SDIO)
#define COMPONENT_WIFI_INTERFACE_SDIO
#endif
#elif defined(CYBSP_WIFI_INTERFACE_TYPE) && (CYBSP_WIFI_INTERFACE_TYPE == CYBSP_SPI_INTERFACE)
#if !defined(COMPONENT_WIFI_INTERFACE_SPI)
#define COMPONENT_WIFI_INTERFACE_SPI
#endif
#elif defined(CYBSP_WIFI_INTERFACE_TYPE) && (CYBSP_WIFI_INTERFACE_TYPE == CYBSP_M2M_INTERFACE)
#if !defined(COMPONENT_WIFI_INTERFACE_M2M)
#define COMPONENT_WIFI_INTERFACE_M2M
#endif
#elif !defined(COMPONENT_WIFI_INTERFACE_OCI)
// For old versions of HAL/BSP fallback to the default interface
#define COMPONENT_WIFI_INTERFACE_SDIO
#endif // if (CYBSP_WIFI_INTERFACE_TYPE == CYBSP_SDIO_INTERFACE)

#endif // if defined(COMPONENT_WIFI_INTERFACE_SDIO)

#if !(defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI))

#define SDIO_ENUMERATION_TRIES              (500)
#define SDIO_RETRY_DELAY_MS                 (1)
#define SDIO_BUS_LEVEL_MAX_RETRIES          (5)

#define SDIO_FREQ_25MHZ                     (25000000)
#define SDIO_FREQ_50MHZ                     (50000000)

// Switching to 1.8 Request / Switching to 1.8V Accepted
#define SDIO_CMD5_S18R_BIT                  (1UL << 24)
// Number of I/O functions position in CMD5 response (R4)
#define SDIO_CMD5_RESP_IO_FUNC_POS          (28)
// Mask of I/O Number in CMD5 response (R4). This field is 3-bit wide
#define SDIO_CMD5_RESP_IO_FUNC_MSK          (0x7)
// The IO OCR register mask in CMD5 request / response (R4)
#define SDIO_CMD5_IO_OCR_MSK                (0x00FFFFFFUL)
// C bit in CMD5 response. Set to 1 if Card is ready to operate after initialization
#define SDIO_CMD5_RESP_IORDY                (1UL << 31)

