hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/whd-bsp-integration/cybsp_wifi.c
// Per SDIO Specification - IO_RW_DIRECT Command (CMD52)

// This bit determines the direction of the I/O operation. If this bit is 0, this command shall read
// data from the SDIO
#define SDIO_CMD52_ARG_RW_READ              (0)
#define SDIO_CMD52_ARG_RW_WRITE             (1)
// The Read after Write flag. If this bit is set to 1 and the R/W flag is set to 1, then the command
// shall read the value of the register after the write
#define SDIO_CMD52_ARG_RAW_NOT_SET          (0)
#define SDIO_CMD52_ARG_RAW_SET              (1)
// The number of the function within the I/O card you wish to read or write. Function 0 selects the
// common I/O area (CIA)
#define SDIO_FUNC_NUM_0                     (0)

// Per SDIO Specification -Card Common Control Registers (CCCR)

// Bus Speed Select register
#define SDIO_CMD52_CCCR_SPEED_SLCT_ADDR     (0x00013)
// Select High Speed by setting BSS0 bit
#define SDIO_CMD52_CCCR_SPEED_SLCT_HS       (0x2)

// Per SDIO specification - IO_RW_DIRECT Response (R5)

// | Start | Dir | CMD Index | Stuff | Response Flags Bit | Read or Write Data | CRC7 | End |
// ------------------------------------------------------------------------------------------
// |   1   |  1  |     6     |  16   |          8         |         8          |  7   |  1  |

// Expected response for High Speed support check command
//                                   | CMD=DAT lines free | High-Speed support |
//                                   |     00010000b      |     00000001b      |
#define SDIO_CMD52_CCCR_SPEED_SELECT_RESP_HS_SUPPORTED  (0x00001001)
// Expected response for High Speed support check command
//                                   | CMD=DAT lines free | HS/SDR25 activated |
//                                   |     00010000b      |     00000010b      |
#define SDIO_CMD52_CCCR_SPEED_SELECT_RESP_HS_SELECTED   (0x00001002)

// *SUSPEND-FORMATTING*
#if !defined(COMPONENT_MTB_HAL)
#if (CY_USE_OOB_INTR != 0)
    // Setup configuration based on configurator or BSP, where configurator has precedence.
    #if defined(CYCFG_WIFI_HOST_WAKE_ENABLED)
        #define CY_WIFI_HOST_WAKE_GPIO  CYCFG_WIFI_HOST_WAKE_GPIO
        #define CY_WIFI_HOST_WAKE_IRQ_EVENT CYCFG_WIFI_HOST_WAKE_IRQ_EVENT
    #else
        // Setup host-wake pin
        #if defined(CYBSP_WIFI_HOST_WAKE)
            #define CY_WIFI_HOST_WAKE_GPIO CYBSP_WIFI_HOST_WAKE
        #else
            #error "CYBSP_WIFI_HOST_WAKE must be defined"
        #endif
        // Setup host-wake irq
        #if defined(CYBSP_WIFI_HOST_WAKE_IRQ_EVENT)
            #define CY_WIFI_HOST_WAKE_IRQ_EVENT CYBSP_WIFI_HOST_WAKE_IRQ_EVENT
        #else
            #error "CYBSP_WIFI_HOST_WAKE_IRQ_EVENT must be defined"
        #endif
    #endif // if defined(CYCFG_WIFI_HOST_WAKE_ENABLED)
#else // if (CY_USE_OOB_INTR != 0)
    #define CY_WIFI_HOST_WAKE_GPIO      CYHAL_NC_PIN_VALUE
    #define CY_WIFI_HOST_WAKE_IRQ_EVENT 0
#endif // (CY_USE_OOB_INTR != 0)
#else
#define CY_WIFI_HOST_WAKE_IRQ_EVENT 0
#endif
// *RESUME-FORMATTING*

// Add compatability for HAL 1.x
#if !defined(CYHAL_API_VERSION) && !defined(COMPONENT_MTB_HAL)
typedef cyhal_transfer_t            cyhal_sdio_transfer_type_t;
#define CYHAL_SDIO_XFER_TYPE_READ   CYHAL_READ
#define CYHAL_SDIO_XFER_TYPE_WRITE  CYHAL_WRITE
#endif

#endif // if !defined(COMPONENT_WIFI_INTERFACE_M2M)

static whd_driver_t whd_drv;

extern whd_resource_source_t resource_ops;

static whd_init_config_t init_config_default =
{
    .thread_stack_size  = CY_WIFI_THREAD_STACK_SIZE,
    .thread_stack_start = NULL,
    .thread_priority    = (uint32_t)CY_WIFI_THREAD_PRIORITY,
    .country            = CY_WIFI_COUNTRY
};

static whd_buffer_funcs_t buffer_if_default =
{
    .whd_host_buffer_get                       = cy_host_buffer_get,
    .whd_buffer_release                        = cy_buffer_release,
    .whd_buffer_get_current_piece_data_pointer = cy_buffer_get_current_piece_data_pointer,
    .whd_buffer_get_current_piece_size         = cy_buffer_get_current_piece_size,
    .whd_buffer_set_size                       = cy_buffer_set_size,
    .whd_buffer_add_remove_at_front            = cy_buffer_add_remove_at_front,
};

static whd_netif_funcs_t netif_if_default =
{
    .whd_network_process_ethernet_data = cy_network_process_ethernet_data,
};

#if !(defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI))
#if !defined(COMPONENT_MTB_HAL)
static const whd_oob_config_t OOB_CONFIG =
{
    .host_oob_pin      = CY_WIFI_HOST_WAKE_GPIO,
    .dev_gpio_sel      = DEFAULT_OOB_PIN,
    .is_falling_edge   = (CY_WIFI_HOST_WAKE_IRQ_EVENT == CYHAL_GPIO_IRQ_FALL)
        ? WHD_TRUE
        : WHD_FALSE,
    #if defined(WHD_OOB_CONFIG_VERSION) && ((WHD_OOB_CONFIG_VERSION) >= 2)
    .drive_mode        = CYBSP_WIFI_WL_HOSTWAKE_DRIVE_MODE,
    .init_drive_state  = CYBSP_WIFI_WL_HOSTWAKE_INIT_STATE,
    #endif
    .intr_priority     = CY_WIFI_OOB_INTR_PRIORITY
};
#endif // if !defined(COMPONENT_MTB_HAL)

#if defined(COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_reset_wifi_chip
//--------------------------------------------------------------------------------------------------
static void _cybsp_wifi_reset_wifi_chip(mtb_hal_gpio_t* reset_pin)
{
    mtb_hal_gpio_write(reset_pin, false);
    // WiFi into reset
    // Allow CBUCK regulator to discharge
    (void)mtb_hal_system_delay_ms(WLAN_CBUCK_DISCHARGE_MS);
    // WiFi out of reset
    mtb_hal_gpio_write(reset_pin, true);
    (void)mtb_hal_system_delay_ms(WLAN_POWER_UP_DELAY_MS);
}


#else // if defined(COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_reset_wifi_chip
//--------------------------------------------------------------------------------------------------
static void _cybsp_wifi_reset_wifi_chip(void)
{
    // WiFi into reset
    // Allow CBUCK regulator to discharge
    (void)cyhal_system_delay_ms(WLAN_CBUCK_DISCHARGE_MS);
    // WiFi out of reset
    cyhal_gpio_write(CYBSP_WIFI_WL_REG_ON, true);
    (void)cyhal_system_delay_ms(WLAN_POWER_UP_DELAY_MS);
}


#endif // if defined(COMPONENT_MTB_HAL)

#endif // if !defined(COMPONENT_WIFI_INTERFACE_M2M)


#if defined(COMPONENT_WIFI_INTERFACE_SDIO)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_sdio_try_send_cmd
//--------------------------------------------------------------------------------------------------
#if defined(COMPONENT_MTB_HAL)
static cy_rslt_t _cybsp_wifi_sdio_try_send_cmd(mtb_hal_sdio_t* sdio_object,
                                               mtb_hal_sdio_host_transfer_type_t direction,
                                               mtb_hal_sdio_host_command_t command,
                                               uint32_t argument,
                                               uint32_t* response)
{
    uint8_t   loop_count = 0;
    cy_rslt_t result     = CYBSP_RSLT_WIFI_SDIO_ENUM_TIMEOUT;
    do
    {
        result = mtb_hal_sdio_host_send_cmd(sdio_object, direction, command, argument, response);
        if (result != CY_RSLT_SUCCESS)
        {
            mtb_hal_system_delay_ms(SDIO_RETRY_DELAY_MS);
        }
        loop_count++;
    } while((result != CY_RSLT_SUCCESS) && (loop_count <= SDIO_BUS_LEVEL_MAX_RETRIES));
    return result;
}


#else // if defined(COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_sdio_try_send_cmd
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _cybsp_wifi_sdio_try_send_cmd(cyhal_sdio_t* sdio_object,
                                               cyhal_sdio_transfer_type_t direction,
                                               cyhal_sdio_command_t command, uint32_t argument,
                                               uint32_t* response)
{
    uint8_t   loop_count = 0;
    cy_rslt_t result     = CYBSP_RSLT_WIFI_SDIO_ENUM_TIMEOUT;
    do
    {
        result = cyhal_sdio_send_cmd(sdio_object, direction, command, argument, response);
        if (result != CY_RSLT_SUCCESS)
        {
            cyhal_system_delay_ms(SDIO_RETRY_DELAY_MS);
        }
        loop_count++;
    } while((result != CY_RSLT_SUCCESS) && (loop_count <= SDIO_BUS_LEVEL_MAX_RETRIES));
    return result;
}


#endif // if defined(COMPONENT_MTB_HAL)

#if !defined(CYHAL_UDB_SDIO)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_create_cmd_52_arg
//--------------------------------------------------------------------------------------------------
static uint32_t _cybsp_wifi_create_cmd_52_arg(uint8_t rw, uint8_t func, uint8_t raw, uint32_t addr,
                                              uint8_t data)
{
    return (((rw & 0x01) << 31)      /* set R/W flag */
            | ((func & 0x07) << 28)  /* set the function number */
            | ((raw & 0x01) << 27)   /* set the RAW flag */
            | ((addr & 0x1FFFF) << 9) /* set the address */
            | data);                 /* set the data */
}


#endif /* !defined(CYHAL_UDB_SDIO) */

//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_sdio_card_init
//--------------------------------------------------------------------------------------------------
#if defined(COMPONENT_MTB_HAL)
static cy_rslt_t _cybsp_wifi_sdio_card_init(mtb_hal_sdio_t* sdio_object)
{
    cy_rslt_t result;
    uint32_t  loop_count = 0;
    uint32_t  rel_addr;

    uint32_t response       = 0;
    uint32_t no_argument    = 0;

    #if !defined(MTB_HAL_UDB_SDIO)
    uint32_t argument       = 0;
    uint32_t io_num         = 0;
    bool     abort_sdio     = false;
    #else
    const bool abort_sdio   = false;
    #endif /* !defined(CYHAL_UDB_SDIO) */

    do
    {
        // Send CMD0 to set it to idle state
        result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, MTB_HAL_SDIO_XFER_TYPE_WRITE,
                                               MTB_HAL_SDIO_CMD_GO_IDLE_STATE,
                                               no_argument, &response /*ignored*/);

