hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/whd-bsp-integration/cybsp_wifi.c
        // CMD5.
        if (result == CY_RSLT_SUCCESS)
        {
            result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, MTB_HAL_SDIO_XFER_TYPE_READ,
                                                   MTB_HAL_SDIO_CMD_IO_SEND_OP_COND,
                                                   no_argument,
                                                   &response /*ignored on UDB-based SDIO*/);
        }

        // UDB-based SDIO does not support io volt switch sequence
        #if !defined(MTB_HAL_UDB_SDIO)
        if (result == CY_RSLT_SUCCESS)
        {
            // Check number of IO functions, that are supported by device
            io_num = (response >> SDIO_CMD5_RESP_IO_FUNC_POS) & SDIO_CMD5_RESP_IO_FUNC_MSK;
            if (io_num > 0)
            {
                // Sending 1.8V switch request
                argument = (response & SDIO_CMD5_IO_OCR_MSK) | SDIO_CMD5_S18R_BIT;

                // CMD5.
                result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, MTB_HAL_SDIO_XFER_TYPE_WRITE,
                                                       MTB_HAL_SDIO_CMD_IO_SEND_OP_COND,
                                                       argument, &response);

                if (CY_RSLT_SUCCESS == result)
                {
                    // IORDY = 1 (Card is ready to operate)
                    if (response & SDIO_CMD5_RESP_IORDY)
                    {
                        // Switching to 1.8V accepted
                        if (response & SDIO_CMD5_S18R_BIT)
                        {
                            // CMD11.
                            result = _cybsp_wifi_sdio_try_send_cmd(sdio_object,
                                                                   MTB_HAL_SDIO_XFER_TYPE_WRITE,
                                                                   MTB_HAL_SDIO_CMD_VOLTAGE_SWITCH,
                                                                   no_argument,
                                                                   &response);

                            if (CY_RSLT_SUCCESS == result)
                            {
                                // Perform voltage switch sequence
                                // And, if pin provided, switch the voltage
                                result = mtb_hal_sdio_host_set_io_voltage(sdio_object,
                                                                          MTB_HAL_SDIO_IO_VOLTAGE_1_8V,
                                                                          MTB_HAL_SDIO_IO_VOLT_ACTION_SWITCH_SEQ_ONLY);
                                if (MTB_HAL_SDIO_RSLT_ERR_UNSUPPORTED == result)
                                {
                                    // Changing IO voltage is not supported by current
                                    // implementation. No reason to try again.
                                    abort_sdio = true;
                                }
                            }
                        }
                        // Nothing to do for 'else'. 1.8V is not supported.
                    }
                    else
                    {
                        result = CYBSP_RSLT_WIFI_SDIO_ENUM_NOT_READY;
                    }
                }
            }
            else
            {
                result = CYBSP_RSLT_WIFI_SDIO_ENUM_IO_NOT_SUPPORTED;
                // IO is not supported by this SD device, no reason to try enumeration again
                abort_sdio = true;
            }
        }
        #endif /* !defined(CYHAL_UDB_SDIO) */

        if (CY_RSLT_SUCCESS == result)
        {
            // Send CMD3 to get RCA.
            result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, MTB_HAL_SDIO_XFER_TYPE_READ,
                                                   MTB_HAL_SDIO_CMD_SEND_RELATIVE_ADDR,
                                                   no_argument, &rel_addr);
        }

        if ((!abort_sdio) && (result != CY_RSLT_SUCCESS))
        {
            mtb_hal_system_delay_ms(SDIO_RETRY_DELAY_MS);
        }
        loop_count++;
    } while ((!abort_sdio) && (result != CY_RSLT_SUCCESS) &&
             (loop_count <= SDIO_ENUMERATION_TRIES));

    if (result == CY_RSLT_SUCCESS)
    {
        // Send CMD7 with the returned RCA to select the card
        result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, MTB_HAL_SDIO_XFER_TYPE_WRITE,
                                               MTB_HAL_SDIO_CMD_SELECT_CARD,
                                               rel_addr,
                                               &response /*ignored*/);
    }


    uint32_t sdio_frequency = SDIO_FREQ_25MHZ;

    // use constant 25 MHz frequency for UDB-based SDIO
    // and perform supported speed check and switch for SDHC-based SDIO
    #if !defined(CYHAL_UDB_SDIO)
    if (result == CY_RSLT_SUCCESS)
    {
        uint32_t tmp_arg = _cybsp_wifi_create_cmd_52_arg(SDIO_CMD52_ARG_RW_READ, SDIO_FUNC_NUM_0,
                                                         SDIO_CMD52_ARG_RAW_NOT_SET,
                                                         SDIO_CMD52_CCCR_SPEED_SLCT_ADDR, 0x00);
        result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, MTB_HAL_SDIO_XFER_TYPE_WRITE,
                                               MTB_HAL_SDIO_CMD_IO_RW_DIRECT,
                                               tmp_arg, &response);

        if (result == CY_RSLT_SUCCESS)
        {
            if (SDIO_CMD52_CCCR_SPEED_SELECT_RESP_HS_SUPPORTED == response)
            {
                tmp_arg = _cybsp_wifi_create_cmd_52_arg(SDIO_CMD52_ARG_RW_WRITE, SDIO_FUNC_NUM_0,
                                                        SDIO_CMD52_ARG_RAW_NOT_SET,
                                                        SDIO_CMD52_CCCR_SPEED_SLCT_ADDR,
                                                        SDIO_CMD52_CCCR_SPEED_SLCT_HS);
                result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, MTB_HAL_SDIO_XFER_TYPE_WRITE,
                                                       MTB_HAL_SDIO_CMD_IO_RW_DIRECT,
                                                       tmp_arg, &response);

                if (result == CY_RSLT_SUCCESS)
                {
                    if (SDIO_CMD52_CCCR_SPEED_SELECT_RESP_HS_SELECTED == response)
                    {
                        // High Speed mode switch allowed, configure clock frequency for 50 MHz
                        sdio_frequency = SDIO_FREQ_50MHZ;
                    }
                }
                else
                {
                    result = CYBSP_RSLT_WIFI_SDIO_HS_SWITCH_FAILED;
                }
            }
        }
    }

    #endif /* !defined(CYHAL_UDB_SDIO) */

    if (result == CY_RSLT_SUCCESS)
    {
        mtb_hal_sdio_cfg_t config = { .frequencyhal_hz = sdio_frequency, .block_size = 0 };
        result = mtb_hal_sdio_configure(sdio_object, &config);
    }
    return result;
}


#else // if defined(COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_sdio_card_init
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _cybsp_wifi_sdio_card_init(cyhal_sdio_t* sdio_object)
{
    cy_rslt_t result;
    uint32_t  loop_count = 0;
    uint32_t  rel_addr;

    uint32_t response       = 0;
    uint32_t no_argument    = 0;

    #if !defined(CYHAL_UDB_SDIO)
    uint32_t argument       = 0;
    uint32_t io_num         = 0;
    bool     abort_sdio     = false;
    #else
    const bool abort_sdio   = false;
    #endif /* !defined(CYHAL_UDB_SDIO) */

    do
    {
        // Send CMD0 to set it to idle state
        result = _cybsp_wifi_sdio_try_send_cmd(sdio_object, CYHAL_SDIO_XFER_TYPE_WRITE,
                                               CYHAL_SDIO_CMD_GO_IDLE_STATE,
                                               no_argument, &response /*ignored*/);

