hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/whd-bsp-integration/cybsp_wifi.c
#if defined(CYBSP_WIFI_SDIO_NEEDS_INIT)
#if (CY_CPU_CORTEX_M55)
CY_SECTION_SHAREDMEM static cyhal_sdio_t sdio_obj;
#else
static cyhal_sdio_t sdio_obj;
#endif
#endif

//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_sdio_init_bus
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _cybsp_wifi_sdio_init_bus(void)
{
    #if defined(CYBSP_WIFI_SDIO_NEEDS_INIT)
    cy_rslt_t result = cyhal_sdio_init(&sdio_obj, CYBSP_WIFI_SDIO_CMD, CYBSP_WIFI_SDIO_CLK,
                                       CYBSP_WIFI_SDIO_D0, CYBSP_WIFI_SDIO_D1, CYBSP_WIFI_SDIO_D2,
                                       CYBSP_WIFI_SDIO_D3);

    if (result == CY_RSLT_SUCCESS)
    {
        result = _cybsp_wifi_sdio_init_bus2(&sdio_obj);
        if (result != CY_RSLT_SUCCESS)
        {
            cyhal_sdio_free(&sdio_obj);
        }
    }
    #else // if defined(CYBSP_WIFI_SDIO_NEEDS_INIT)
    cyhal_sdio_t* sdio_p = cybsp_get_wifi_sdio_obj();
    cy_rslt_t result = _cybsp_wifi_sdio_init_bus2(sdio_p);
    #endif // if defined(CYBSP_WIFI_SDIO_NEEDS_INIT)

    return result;
}


#endif // if defined(COMPONENT_MTB_HAL)

#elif defined(COMPONENT_WIFI_INTERFACE_SPI)

//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_spi_init_bus
//--------------------------------------------------------------------------------------------------
#if defined(COMPONENT_MTB_HAL)
static cy_rslt_t _cybsp_wifi_spi_init_bus(mtb_hal_spi_t* spi_obj, mtb_hal_gpio_t* host_wake_pin)
{
    cy_rslt_t rslt = mtb_hal_spi_set_frequency(&spi_obj, 50000000); // 50 MHz operation
    if (CY_RSLT_SUCCESS == rslt)
    {
        whd_oob_config_t spi_oob_config =
        {
            .host_oob_pin      = host_wake_pin,
            .dev_gpio_sel      = DEFAULT_OOB_PIN,
            .is_falling_edge   = (CY_WIFI_HOST_WAKE_IRQ_EVENT == MTB_HAL_GPIO_IRQ_FALL)
                ? WHD_TRUE
                : WHD_FALSE,
            #if defined(WHD_OOB_CONFIG_VERSION) && ((WHD_OOB_CONFIG_VERSION) >= 2)
            .drive_mode        = CYBSP_WIFI_WL_HOSTWAKE_DRIVE_MODE,
            .init_drive_state  = CYBSP_WIFI_WL_HOSTWAKE_INIT_STATE,
            #endif
            .intr_priority     = CY_WIFI_OOB_INTR_PRIORITY
        };

        whd_spi_config_t whd_spi_config =
        {
            .is_normal_mode      = false,
            .oob_config          = spi_oob_config
        };
        rslt = whd_bus_spi_attach(whd_drv, &whd_spi_config, &spi_obj);
    }
    return rslt
}


#elif defined(CY_USING_HAL)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_spi_init_bus
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _cybsp_wifi_spi_init_bus(void)
{
    static cyhal_spi_t spi_obj;
    cy_rslt_t rslt = cyhal_spi_init(&spi_obj,
                                    CYBSP_WIFI_SPI_MOSI, CYBSP_WIFI_SPI_MISO, CYBSP_WIFI_SPI_SCLK,
                                    CYBSP_WIFI_SPI_SSEL,
                                    NULL, 32, CYHAL_SPI_MODE_00_MSB, false);
    if (CY_RSLT_SUCCESS == rslt)
    {
        rslt = cyhal_spi_set_frequency(&spi_obj, 50000000); // 50 MHz operation
        if (CY_RSLT_SUCCESS == rslt)
        {
            whd_spi_config_t whd_spi_config =
            {
                .is_normal_mode      = false,
                .oob_config          = OOB_CONFIG
            };
            rslt = whd_bus_spi_attach(whd_drv, &whd_spi_config, &spi_obj);
        }
        else
        {
            cyhal_spi_free(&spi_obj);
        }
    }

    return rslt;
}


#endif // if defined(COMPONENT_MTB_HAL)
#elif defined(COMPONENT_WIFI_INTERFACE_M2M)

static cyhal_m2m_t m2m_obj;

//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_m2m_init_bus
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _cybsp_wifi_m2m_init_bus(void)
{
    cy_rslt_t rslt;

    whd_m2m_config_t whd_m2m_config =
    {
        .is_normal_mode = false,
    };
    // Note: The m2m itself is initialized in the WHD
    rslt = whd_bus_m2m_attach(whd_drv, &whd_m2m_config, &m2m_obj);

    return rslt;
}


#elif defined(COMPONENT_WIFI_INTERFACE_OCI)

//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_custom_init_bus
//--------------------------------------------------------------------------------------------------
static cy_rslt_t _cybsp_wifi_custom_init_bus(void)
{
    cy_rslt_t rslt;

    whd_oci_config_t whd_oci_config =
    {
        .is_normal_mode = false,
    };
    // Note: The oci itself is initialized in the WHD
    rslt = whd_bus_oci_attach(whd_drv, &whd_oci_config);

    return rslt;
}


#endif // defined(COMPONENT_WIFI_INTERFACE_M2M)


//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_bus_init
//--------------------------------------------------------------------------------------------------
#if defined(CY_USING_HAL)

static inline cy_rslt_t _cybsp_wifi_bus_init(void)
{
    #if !(defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI))
    _cybsp_wifi_reset_wifi_chip();
    #endif
    #if defined(COMPONENT_WIFI_INTERFACE_SDIO)
    return _cybsp_wifi_sdio_init_bus();
    #elif defined(COMPONENT_WIFI_INTERFACE_SPI)
    return _cybsp_wifi_spi_init_bus();
    #elif defined(COMPONENT_WIFI_INTERFACE_M2M)
    return _cybsp_wifi_m2m_init_bus();
    #elif defined(COMPONENT_WIFI_INTERFACE_OCI)
    return _cybsp_wifi_custom_init_bus();
    #endif
}


#endif // if defined(CY_USING_HAL)
//--------------------------------------------------------------------------------------------------
// _cybsp_wifi_bus_detach
//--------------------------------------------------------------------------------------------------
static inline void _cybsp_wifi_bus_detach(void)
{
    #if defined(COMPONENT_WIFI_INTERFACE_SDIO)
    whd_bus_sdio_detach(whd_drv);
    #elif defined(COMPONENT_WIFI_INTERFACE_SPI)
    whd_bus_spi_detach(whd_drv);
    #elif defined(COMPONENT_WIFI_INTERFACE_M2M)
    whd_bus_m2m_detach(whd_drv);
    #elif defined(COMPONENT_WIFI_INTERFACE_OCI)
    whd_bus_oci_detach(whd_drv);
    #endif
}


