hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/whd-bsp-integration/cybsp_wifi.c
#if defined(COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// cybsp_wifi_init_primary_sdio
//--------------------------------------------------------------------------------------------------
cy_rslt_t cybsp_wifi_init_primary_sdio(whd_interface_t* interface,
                                       whd_init_config_t* init_config,
                                       whd_resource_source_t* resource_if,
                                       whd_buffer_funcs_t* buffer_if,
                                       whd_netif_funcs_t* netif_if,
                                       mtb_hal_sdio_t* sdio_obj,
                                       mtb_hal_gpio_t* host_wake_pin,
                                       mtb_hal_gpio_t* reset_pin)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    if (init_config == NULL)
    {
        init_config = &init_config_default;
    }
    if (resource_if == NULL)
    {
        resource_if = &resource_ops;
    }
    if (buffer_if == NULL)
    {
        buffer_if = &buffer_if_default;
    }
    if (netif_if == NULL)
    {
        netif_if = &netif_if_default;
    }

    result = whd_init(&whd_drv, init_config, resource_if, buffer_if, netif_if);
    if (result == CY_RSLT_SUCCESS)
    {
        _cybsp_wifi_reset_wifi_chip(reset_pin);

        result = _cybsp_wifi_sdio_card_init(sdio_obj);
        if (result == CY_RSLT_SUCCESS)
        {
            whd_oob_config_t sdio_oob_config =
            {
                .host_oob_pin      = host_wake_pin,
                .dev_gpio_sel      = DEFAULT_OOB_PIN,
                .is_falling_edge   = (CY_WIFI_HOST_WAKE_IRQ_EVENT == MTB_HAL_GPIO_IRQ_FALL)
                    ? WHD_TRUE
                    : WHD_FALSE,
                #if defined(WHD_OOB_CONFIG_VERSION) && ((WHD_OOB_CONFIG_VERSION) >= 2)
                .drive_mode        = CYBSP_WIFI_WL_HOSTWAKE_DRIVE_MODE,
                .init_drive_state  = CYBSP_WIFI_WL_HOSTWAKE_INIT_STATE,
                #endif
                .intr_priority     = CY_WIFI_OOB_INTR_PRIORITY
            };

            whd_sdio_config_t whd_sdio_config =
            {
                .sdio_1bit_mode        = WHD_FALSE,
                .high_speed_sdio_clock = WHD_FALSE,
                .oob_config            = sdio_oob_config
            };
            result = whd_bus_sdio_attach(whd_drv, &whd_sdio_config, sdio_obj);

            if (result == CY_RSLT_SUCCESS)
            {
                result = whd_wifi_on(whd_drv, interface);

                if (result != CY_RSLT_SUCCESS)
                {
                    _cybsp_wifi_bus_detach();
                }
            }
        }
        if (result != CY_RSLT_SUCCESS)
        {
            whd_deinit(*interface);
        }
    }
    return result;
}


#if defined(COMPONENT_WIFI_INTERFACE_SPI)
//--------------------------------------------------------------------------------------------------
// cybsp_wifi_init_primary_spi
//--------------------------------------------------------------------------------------------------
cy_rslt_t cybsp_wifi_init_primary_spi(whd_interface_t* interface,
                                      whd_init_config_t* init_config,
                                      whd_resource_source_t* resource_if,
                                      whd_buffer_funcs_t* buffer_if,
                                      whd_netif_funcs_t* netif_if,
                                      mtb_hal_spi_t* spi_obj,
                                      mtb_hal_gpio_t* host_wake_pin,
                                      mtb_hal_gpio_t* reset_pin)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    if (init_config == NULL)
    {
        init_config = &init_config_default;
    }
    if (resource_if == NULL)
    {
        resource_if = &resource_ops;
    }
    if (buffer_if == NULL)
    {
        buffer_if = &buffer_if_default;
    }
    if (netif_if == NULL)
    {
        netif_if = &netif_if_default;
    }

    result = whd_init(&whd_drv, init_config, resource_if, buffer_if, netif_if);
    if (result == CY_RSLT_SUCCESS)
    {
        _cybsp_wifi_reset_wifi_chip(reset_pin);

        result = _cybsp_wifi_spi_init_bus(spi_obj, host_wake_pin);

        if (result == CY_RSLT_SUCCESS)
        {
            result = whd_wifi_on(whd_drv, interface);

            if (result != CY_RSLT_SUCCESS)
            {
                _cybsp_wifi_bus_detach();
            }
        }

        if (result != CY_RSLT_SUCCESS)
        {
            whd_deinit(*interface);
        }
    }
    return result;
}


#endif // if defined(COMPONENT_WIFI_INTERFACE_SPI)

#if defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI)
//--------------------------------------------------------------------------------------------------
// cybsp_wifi_init_primary_extended
//--------------------------------------------------------------------------------------------------
cy_rslt_t cybsp_wifi_init_primary_extended_m2m_or_oci(whd_interface_t* interface,
                                                      whd_init_config_t* init_config,
                                                      whd_resource_source_t* resource_if,
                                                      whd_buffer_funcs_t* buffer_if,
                                                      whd_netif_funcs_t* netif_if)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    if (init_config == NULL)
    {
        init_config = &init_config_default;
    }
    if (resource_if == NULL)
    {
        resource_if = &resource_ops;
    }
    if (buffer_if == NULL)
    {
        buffer_if = &buffer_if_default;
    }
    if (netif_if == NULL)
    {
        netif_if = &netif_if_default;
    }

    result = whd_init(&whd_drv, init_config, resource_if, buffer_if, netif_if);
    if (result == CY_RSLT_SUCCESS)
    {
        #if defined(COMPONENT_WIFI_INTERFACE_M2M)
        result = _cybsp_wifi_m2m_init_bus();
        #elif defined(COMPONENT_WIFI_INTERFACE_OCI)
        result = _cybsp_wifi_custom_init_bus();
        #endif

        if (result == CY_RSLT_SUCCESS)
        {
            result = whd_wifi_on(whd_drv, interface);

            if (result != CY_RSLT_SUCCESS)
            {
                _cybsp_wifi_bus_detach();
            }
        }

        if (result != CY_RSLT_SUCCESS)
        {
            whd_deinit(*interface);
        }
    }
}


#endif // defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI)
#elif defined(CY_USING_HAL)
//--------------------------------------------------------------------------------------------------
// cybsp_wifi_init_primary_extended
//--------------------------------------------------------------------------------------------------
cy_rslt_t cybsp_wifi_init_primary_extended(whd_interface_t* interface,
                                           whd_init_config_t* init_config,
                                           whd_resource_source_t* resource_if,
                                           whd_buffer_funcs_t* buffer_if,
                                           whd_netif_funcs_t* netif_if)
{
    #if (defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI))
    cy_rslt_t result = CY_RSLT_SUCCESS;
    #else
    cy_rslt_t result = cyhal_gpio_init(CYBSP_WIFI_WL_REG_ON, CYHAL_GPIO_DIR_OUTPUT,
                                       CYBSP_WIFI_WL_REG_ON_GPIO_DRIVE_MODE, false);
    #endif

    if (result == CY_RSLT_SUCCESS)
    {
        if (init_config == NULL)
        {
            init_config = &init_config_default;
        }
        if (resource_if == NULL)
        {
            resource_if = &resource_ops;
        }
        if (buffer_if == NULL)
        {
            buffer_if = &buffer_if_default;
        }
        if (netif_if == NULL)
        {
            netif_if = &netif_if_default;
        }

        if (result == CY_RSLT_SUCCESS)
        {
            result = whd_init(&whd_drv, init_config, resource_if, buffer_if, netif_if);
            if (result == CY_RSLT_SUCCESS)
            {
                result = _cybsp_wifi_bus_init();

                if (result == CY_RSLT_SUCCESS)
                {
                    result = whd_wifi_on(whd_drv, interface);

                    if (result != CY_RSLT_SUCCESS)
                    {
                        _cybsp_wifi_bus_detach();
                    }
                }

                if (result != CY_RSLT_SUCCESS)
                {
                    whd_deinit(*interface);
                }
            }
        }

        #if !(defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI))
        if (result != CY_RSLT_SUCCESS)
        {
            cyhal_gpio_free(CYBSP_WIFI_WL_REG_ON);
        }
        #endif
    }

    return result;
}


#endif // if defined(COMPONENT_MTB_HAL)

//--------------------------------------------------------------------------------------------------
// cybsp_wifi_init_secondary
//--------------------------------------------------------------------------------------------------
cy_rslt_t cybsp_wifi_init_secondary(whd_interface_t* interface, whd_mac_t* mac_address)
{
    return whd_add_secondary_interface(whd_drv, mac_address, interface);
}


//--------------------------------------------------------------------------------------------------
// cybsp_wifi_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cybsp_wifi_deinit(whd_interface_t interface)
{
    cy_rslt_t result = whd_wifi_off(interface);

    if (result == CY_RSLT_SUCCESS)
    {
        _cybsp_wifi_bus_detach();
        #if !defined(COMPONENT_MTB_HAL)
        #if !(defined(COMPONENT_WIFI_INTERFACE_M2M) || defined(COMPONENT_WIFI_INTERFACE_OCI))
        cyhal_gpio_free(CYBSP_WIFI_WL_REG_ON);
        #endif
        #endif
        // While deinit() takes an interface, it only uses it to get the underlying whd driver to
        // cleanup. As a result, we only need to call this on one of the interfaces.
        result = whd_deinit(interface);

        #if defined(CYBSP_WIFI_SDIO_NEEDS_INIT) && !defined(COMPONENT_MTB_HAL)
        if (result == CY_RSLT_SUCCESS)
        {
            cyhal_sdio_free(&sdio_obj);
        }
        #endif
    }
    return result;
}


//--------------------------------------------------------------------------------------------------
// cybsp_get_wifi_driver
//--------------------------------------------------------------------------------------------------
whd_driver_t cybsp_get_wifi_driver(void)
{
    return whd_drv;
}


#if defined(__cplusplus)
}
#endif
